# При старте, приложение предлагает начать новую игру или выйти из приложения
# При начале новой игры, случайным образом загадывается слово, и игрок начинает процесс по его отгадыванию
# После каждой введенной буквы выводим в консоль счётчик ошибок, текущее состояние виселицы (нарисованное ASCII символами)
# По завершении игры выводим результат (победа или поражение) и возвращаемся к состоянию
#1 - предложение начать новую игру или выйти из приложения
#
#
#
import random

def start_app():
    print("игра виселица. пользователь вводит символы один за другим. ошибиться можно не более 5 раз")
    while True:
        print("нажмите")
        print("1. чтобы начать игру")
        print("2. чтобы выйти")
        users_number = input()
        if users_number.isdigit():
            if int(users_number) == 1:
                start_game()
            elif int(users_number) == 2:
                print("приложение завершено")
                break
            else:
                print("введите 1 или 2")
        else:
            print("введите цифру")

def start_game():
    print("игра началась")
    word = list(random_choice())
    users_word = ['_'] * len(word)  #отгаданные
    mask = word.copy() #осталось отгадать
    used_letters = set() #введено ошибочно
    mistakes = 0

    print("ваше слово: ", ''.join(users_word))
    show_mistakes(mistakes)

    while True:
        print("введите букву")
        if check_letter(word, users_word, mask, used_letters):
            if word == users_word:
                print('загаданное слово:', ''.join(users_word))
                print("ВЫ ВЫИГРАЛИ!")
                return

        else:             #если пользователь ошибся
            mistakes += 1

        show_mistakes(mistakes)
        print(*users_word)
        print("счетчик ошибок: ", mistakes)
        if mistakes == 6:
            print("ВЫ ПРОИГРАЛИ!")
            print("загаданное слово: ", *word)
            return



def check_letter(word, users_word, mask, used_letters):
    letter = input().lower()
    if len(letter) == 1 and letter.isalpha() and 'а' <= letter <= 'я':
        if letter in word:
            if letter in mask:
                print("вы отгадали букву")
                for i in range(len(mask)):
                    if mask[i] == letter:
                        users_word[i] = letter
                        mask[i] = '_'
                return True

            elif letter in users_word:
                print("вы уже отгадали эту букву")
                return True
        else:
            if letter in used_letters:
                print("такой буквы нет. вы уже вводили эту букву")
                return True
            else:
                print("такой буквы нет")
                used_letters.add(letter)
                return False
    elif len(letter) > 1:
        print("ошибка. вы ввели несколько символов")
    elif not letter.isalpha():
        print("ошибка. нужно ввести букву")
    elif not 'а' <= letter <= 'я':
        print("ошибка. нужно ввести букву на руссом языке")
    else:
        print('ошибка')
    return True




def show_mistakes(mistakes):

    if mistakes == 6:
        draw = ''' 
        ---------------
                      |
                      0
                     /|\\
                     / \\
        '''
    elif mistakes == 5:
        draw = ''' 
        ---------------
                      |
                      0
                     /|\\
                     / 
        '''
    elif mistakes == 4:
        draw = ''' 
        ---------------
                      |
                      0
                     /|\\
                     
        '''
    elif mistakes == 3:
        draw = ''' 
        ---------------
                      |
                      0
                     /|
                     
        '''
    elif mistakes == 2:
        draw = ''' 
        ---------------
                      |
                      0
                      |
                   
        '''
    elif mistakes == 1:
        draw = ''' 
        ---------------
                      |
                      0
                     
                    
        '''
    elif mistakes == 0:
        draw = ''' 
        ---------------
                      |
                      
                   
                     
        '''
    else:
        print('ошибка')
        return

    print(draw)



def random_choice():
    words = ["абажур", "абзац", "абонент", "абрикос", "авангард", "автобус", "авторитет", "агентство", "агроном",
             "адресат", "академик", "аквариум", "аккорд", "аккумулятор", "акробат", "активист", "аллея", "алмаз",
             "алфавит", "амбар", "амбиция", "ампула", "ананас", "ангелок", "анекдот", "анкета", "антенна", "апельсин",
             "аппарат", "аптека", "арбуз", "аргумент", "арена", "артист", "археолог", "архив", "асфальт", "атака",
             "атлас", "атмосфера", "афиша", "бабочка", "багажник", "базилик", "балкон", "бандит", "банкир", "барабан",
             "барьер", "бассейн", "батарея", "башмак", "бегемот", "бегунок", "бедствие", "бездна", "белка", "бензин",
             "береза", "библиотека", "билет", "бинокль", "биология", "биржа", "бисер", "бисквит", "благодать",
             "блокнот", "блюдце", "богатство", "болезнь", "болото", "ботинок", "браслет", "братство", "бревно",
             "бригада", "бровь", "бронза", "букет", "буклет", "бумага", "бутылка", "вагончик",
             "валенок", "валюта", "варенье", "василек", "вахтер", "ведро", "величина", "велосипед", "веранда",
             "верблюд", "веревка", "веселье", "ветеран", "ветчина", "вешалка", "вещество", "вздох", "видео", "вилка",
             "виноград", "витрина", "вихрь", "владелец", "влияние", "внимание", "водитель", "водопад", "воздух",
             "вокзал", "волшебник", "вопрос", "воробей", "ворота", "восторг", "врачебник", "время", "вселенная",
             "встреча", "выбор", "выключатель", "выставка", "вышивка", "газета", "газон", "галерея", "галстук", "гараж",
             "гардероб", "гармония", "гвоздика", "генерал", "география", "герой", "гимнастика", "гитара", "глава",
             "глина", "глубина", "гнездо", "говядина", "голова", "голубика", "гордость", "горшок", "гостиница",
             "градус", "гражданин", "грамматика", "граница", "гребень", "гречка", "грибок", "гроза", "группа", "грусть",
             "гусеница", "давление", "дворец", "девушка", "декабрь", "декорация", "деление", "деревня", "десерт",
             "детство", "деятель", "диалог", "диванчик", "директор", "дисциплина", "дневник", "добавка", "доверие",
             "договор", "документ", "должность", "дорога", "достоинство", "дракон", "дружба", "духовка", "ежевика",
             "елочка", "жадность", "желание", "железо", "жемчуг", "животное", "журнал", "забота", "завод", "загадка",
             "задание", "закат", "закон", "залив", "замена", "заметка", "замок", "занавес", "запас", "зарплата",
             "зарядка", "защита", "звезда", "зверек", "здание", "зеркало", "зерно", "зимовка", "знакомство", "золото",
             "зонтик", "зубило", "иголка", "игрушка", "издание", "изюминка", "икона", "иллюзия", "имение", "импульс",
             "инженер", "интерес", "интернет", "ириска", "искусство", "история", "источник", "кабинет", "каблук",
             "казарма", "календарь", "камень", "кампания", "каникулы", "капуста", "карандаш", "картина", "картофель",
             "кассета", "категория", "квартира", "керамика", "клавиша", "климат", "книга", "кнопка",
             "колесо", "коллекция", "колодец", "команда", "комната", "компания", "компьютер", "конверт", "конфета",
             "корабль", "коридор", "корица", "коробка", "королева", "костюм", "кошелек", "красота", "кресло", "кровать",
             "кружка", "крыльцо", "культура", "куртка", "кухня", "лаборатория", "ладонь", "лампочка", "легенда",
             "лекарство", "лестница", "лимонад", "линейка", "литература", "лодочка", "лопата", "лотерея", "лошадь",
             "любовь", "магазин", "майонез", "макарон", "малина", "малыш", "маркер", "машина", "медаль", "медведь",
             "мелодия", "металл", "метод", "мечта", "микрофон", "минута", "молоко", "монета", "морковь", "мороз",
             "музей", "музыка", "мышление", "набор", "навык", "надежда", "название", "напиток", "народ", "наука",
             "начало", "небоход", "недвижимость", "неделя", "нежность", "незабудка", "новость", "ножницы", "номер",
             "носорог", "облако", "область", "обложка", "обувь", "огород", "одежда", "океан",
             "операция", "орбита", "организм", "орешек", "ошибка", "пакет", "палата", "памятник", "панель", "папка",
             "парад", "паркет", "паровоз", "паспорт", "паутина", "пейзаж", "пенал", "песня", "печенье", "пианино",
             "пиджак", "пирамида", "пирожок", "письмо", "планета", "пластик", "платье", "площадь", "победа", "погода",
             "подарок", "поездка", "полдень", "полка", "полотно", "помощь", "портфель", "порядок", "посуда", "потолок",
             "праздник", "предмет", "природа", "причина", "проблема", "продукт", "проект", "профессия", "пружина",
             "птица", "путешествие", "пчела", "работа", "радость", "район", "ракета", "растение", "рецепт", "рисунок",
             "родина", "ромашка", "рюкзак", "салфетка", "самолет", "сапог", "сахар", "свитер", "свобода", "секунда",
             "сердце", "сериал", "сирень", "система", "сказка", "скатерть", "скрипка", "словарь", "сметана", "собака",
             "событие", "солнце", "сообщение", "соседство", "состояние",
             "спальня", "спектакль", "спорт", "страна", "страница", "студент", "суббота", "сумка", "супермаркет",
             "сырник", "таблица", "тарелка", "театр", "телефон", "тетрадь", "течение", "тишина", "товар", "товарищ",
             "топливо", "тортилья", "традиция", "транспорт", "тревога", "тропинка", "трудность", "убежище", "удача",
             "украшение", "улица", "улыбка", "университет", "упражнение", "устройство", "утенок", "фабрика", "фамилия",
             "фантазия", "февраль", "фермер", "фигурка", "физика", "фонарь", "фотография", "футбол", "характер",
             "хлебница", "хозяйство", "художник", "цветок", "ценность", "церковь", "чайник", "человек", "черника",
             "чертеж", "чеснок", "чистота", "чтение", "чувство", "шапочка", "шкафчик", "школа", "шоколад", "шорох",
             "шоссе", "щенок", "щетка", "экзамен", "экология", "экономика", "экран", "экскурсия", "энергия", "этажерка",
             "яблоко", "ягода", "язычок", "якорь", "янтарь"]

    count_words = len(words)
    random_number = random.randint(0, count_words-1)
    return words[random_number]

if __name__ == '__main__':
    start_app()